# ---------------------------------------------------------------------------------
#  /\_/\  🌐 This module was loaded through https://t.me/hikkamods_bot
# ( o.o )  🔐 Licensed under the GNU AGPLv3.
#  > ^ <   ⚠️ Owner of heta.hikariatama.ru doesn't take any responsibilities or intellectual property rights regarding this script
# ---------------------------------------------------------------------------------
# Name: AsciiCats
# Description: No description
# Author: skillzmeow
# Commands:
# .face | .meow
# ---------------------------------------------------------------------------------


__version__ = (0, 0, 2)

# module by:
# █▀ █▄▀ █ █░░ █░░ ▀█
# ▄█ █░█ █ █▄▄ █▄▄ █▄
#        /\_/\
#       ( o.o )
#        > ^ <
# █▀▄▀█ █▀▀ █▀█ █░█░█
# █░▀░█ ██▄ █▄█ ▀▄▀▄▀
#   you can edit this module
#            2022
# 🔒 Licensed under the AGPL-3.0
# 🌐 https://www.gnu.org/licenses/agpl-3.0.html

# MEOW MEOW MEOW MEOW MEOW MEOW MEOW MEOW MEOW MWOW
# meta developer: @smeowcodes

import random as r

from telethon.tl.types import Message

from .. import loader, utils


class AsciiCatsMod(loader.Module):
    strings = {
        "name": "AsciiCats",
    }

    async def facecmd(self, message: Message):
        "shows a ascii faces"
        cats = [
            "｡＾･ｪ･＾｡",
            "( ͒ ु- •̫̮ – ू ͒)",
            "( ^..^)ﾉ",
            "( =①ω①=)",
            "( =ω=)..nyaa",
            "( =ノωヽ=)",
            "(´; ω ;｀)",
            "(^-人-^)",
            "(^･o･^)ﾉ”",
            "(^・ω・^ )",
            "(^._.^)ﾉ",
            "(^人^)",
            "(・∀・)",
            "(,,◕　⋏　◕,,)",
            "(.=^・ェ・^=)",
            "(｡･ω･｡)",
            "((≡^⚲͜^≡))",
            "((ΦωΦ))",
            "(*^ω^*)",
            "(*✧×✧*)",
            "(*ΦωΦ*)",
            "(⁎˃ᆺ˂)",
            "(ٛ⁎꒪̕ॢ ˙̫ ꒪ٛ̕ॢ⁎)",
            "₍˄·͈༝·͈˄₎◞ ̑̑ෆ⃛",
            "₍˄·͈༝·͈˄₎ฅ˒˒",
            "₍˄ุ.͡˳̫.˄ุ₎ฅ˒˒",
            "(=｀ω´=)",
            "(=｀ェ´=)",
            "（=´∇｀=）",
            "(=^ ◡ ^=)",
            "(=^-ω-^=)",
            "(=^･^=)",
            "(=^･ω･^)y＝",
            "(=^･ω･^=)",
            "(=^･ｪ･^=)",
            "(=^‥^=)",
            "(=･ω･=)",
            "(=;ω;=)",
            "(=;ェ;=)",
            "(=；ェ；=)",
            "(=;ェ;=)",
            "(=；ェ；=)",
            "(=；ｪ；=)",
            "(=‘ｘ‘=)",
            "(=⌒‿‿⌒=)",
            "(=ↀωↀ=)",
            "(=ↀωↀ=)✧",
            "(=①ω①=)",
            "(=ＴェＴ=)",
            "(=ｘェｘ=)",
            "(=ΦｴΦ=)",
            "(ٛ₌டுͩ ˑ̭ டுͩٛ₌)ฅ",
            "(≚ᄌ≚)ℒℴѵℯ❤",
            "(≚ᄌ≚)ƶƵ",
            "(○｀ω´○)",
            "(●ↀωↀ●)",
            "(●ↀωↀ●)✧",
            "(✦థ ｪ థ)",
            "(ↀДↀ)",
            "(ↀДↀ)⁼³₌₃",
            "(ↀДↀ)✧",
            "(๑•ω•́ฅ✧",
            "(๑ↀᆺↀ๑)☄",
            "(๑ↀᆺↀ๑)✧",
            "(p`･ω･´) q",
            "(p`ω´) q",
            "(Φ∇Φ)",
            "(ΦεΦ)",
            "(ΦωΦ)",
            "(ΦёΦ)",
            "(ΦзΦ)",
            "(ฅ`･ω･´)っ=",
            "(ฅ`ω´ฅ)",
            "(ฅ’ω’ฅ)",
            "(ะ`♔´ะ)",
            "(ะ☫ω☫ะ)",
            "(ㅇㅅㅇ❀)",
            "(ノω<。)",
            "(ꀄꀾꀄ)",
            "（三ФÅФ三）",
            "[ΦωΦ]",
            "] ‘͇̂•̩̫’͇̂ ͒)ฅ ﾆｬ❣",
            "＼(=^‥^)/’`",
            "<(*ΦωΦ*)>",
            "<ΦωΦ>",
            "|ΦωΦ|",
            "|ｪ･`｡)･･･　　",
            "~(=^‥^)",
            "~(=^‥^)_旦~",
            "~(=^‥^)/",
            "~(=^‥^)ノ",
            "~□Pヘ(^･ω･^=)~",
            "⊱ฅ•ω•ฅ⊰",
            "└(=^‥^=)┐",
            "✩⃛( ͒ ु•·̫• ू ͒)",
            "❤(´ω｀*)",
            "ヽ(^‥^=ゞ)",
            "ヾ(*ΦωΦ)ﾉ",
            "ヾ(*ФωФ)βyё βyё☆彡",
            "ヾ(=｀ω´=)ノ”",
            "ヽ(=^･ω･^=)丿",
            "ヾ(=ﾟ･ﾟ=)ﾉ",
            "0( =^･_･^)=〇",
            "٩(ↀДↀ)۶",
            "b(=^‥^=)o",
            "d(=^･ω･^=)b",
            "o(^・x・^)o",
            "o(=・ω・=o)",
            "V(=^･ω･^=)v",
            "ლ(=ↀωↀ=)ლ",
            "ლ(●ↀωↀ●)ლ",
            "ฅ ̂⋒ิ ˑ̫ ⋒ิ ̂ฅ",
            "ฅ( ᵕ ω ᵕ )ฅ",
            "ฅ(´-ω-`)ฅ",
            "ฅ(´・ω・｀)ฅ",
            "ฅ(^ω^ฅ)",
            "ฅ(≚ᄌ≚)",
            "ฅ(⌯͒• ɪ •⌯͒)ฅ❣",
            "ฅ⃛(⌯͒꒪ั ˑ̫ ꒪ั ⌯͒) ﾆｬｯ❣",
            "ฅ(●´ω｀●)ฅ",
            "ฅ*•ω•*ฅ♡",
            "ฅ•ω•ฅ",
            "ฅ⊱*•ω•*⊰ฅ",
            "ㅇㅅㅇ",
            "ミ๏ｖ๏彡",
            "ミ◕ฺｖ◕ฺ彡",
            "=＾● ⋏ ●＾=",
            "ฅ^•ﻌ•^ฅ",
            "₍ᵔ·͈༝·͈ᵔ₎",
            "ฅ(⌯͒•̩̩̩́ ˑ̫ •̩̩̩̀⌯͒)ฅ",
            "₍˄·͈༝·͈˄*₎◞ ̑̑",
            "ଲ( ⓛ ω ⓛ *)ଲ",
            "=^._.^= ∫",
            "ଲ(⁃̗̀̂❍⃓ˑ̫❍⃓⁃̠́̂)ଲ",
        ]
        await utils.answer(message, f"<code>{r.choice(cats)}</code>")

    async def meowcmd(self, message: Message):
        "send a cute cat arts"
        cats = [
            "ᅠ ᅠ  ᅠ\n|\---/| \n| o_o | \n \_^_/ \n  ᅠᅠ   ",
            "ᅠ ᅠᅠᅠ\n /\_/\ \n( o.o ) \n > ^ < \nᅠ ᅠ ᅠᅠ ",
            (
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠᅠ ᅠᅠ\n"
                "    |\__/,|   (`\ \n"
                "  _.|o o  |_   ) ) \n"
                "-(((---(((-------- \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ ᅠᅠ"
            ),
            (
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ ᅠ\n"
                " _._     _,-'''''`-._ \n"
                "(,-.`._,'(       |\`-/| \n"
                "    `-.-' \ )-`( , o o) \n"
                "          `-    \`_`='- \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ ᅠ"
            ),
            "ᅠ ᅠᅠ \n\    /\ \n )  ( ') \n(  /  ) \n \(__)| \nᅠ ᅠᅠ ᅠ",
            "ᅠ ᅠ ᅠᅠ\n /\_/\ \n( o o ) \n==_Y_== \n  `-' \nᅠ ᅠ ᅠᅠ ᅠ",
            (
                "ᅠ ᅠ ᅠᅠ ᅠ ᅠᅠ ᅠ\n"
                " |\__/,|   (`\ \n"
                " |_ _  |.--.) ) \n"
                " ( T   )     / \n"
                "(((^_(((/(((_/ \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ ᅠ"
            ),
            (
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠᅠᅠ ᅠᅠ ᅠ ᅠ \n"
                "    /\_/\           ___ \n"
                "   = o_o =_______    \ \ yuki \n"
                "    __^      __(  \.__) ) \n"
                "($)<_____>__(_____)____/ \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ ᅠᅠ ᅠᅠ "
            ),
            (
                "ᅠ ᅠ ᅠᅠ ᅠ ᅠ\n"
                "  |'/-..--. \n"
                " / _ _   ,  ; \n"
                "`~=`Y'~_<._./ \n"
                " <`-....__.' \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠ"
            ),
            (
                "ᅠ ᅠ    ᅠ\n"
                "  /\_/\  ( \n"
                " ( ^.^ ) _) \n"
                "  \ ' / ( \n"
                " ( | | ) \n"
                "(__d b__) \n"
                "ᅠ ᅠ ᅠᅠ ᅠ ᅠ"
            ),
            (
                "ᅠ ᅠᅠ   ᅠᅠ\n"
                " .       . \n"
                " |\_---_/| \n"
                "/   o_o   \ \n"
                "|    U    | \n"
                "\  ._I_.  / \n"
                " `-_____-' \n"
                "ᅠ ᅠ ᅠᅠ  ᅠᅠ"
            ),
            (
                "ᅠ ᅠ ᅠ ᅠ ᅠᅠ\n"
                "      /\_/\ \n"
                " /\  / o o \ \n"
                "//\\ \~(*)~/ \n"
                "`  \/   ^ / \n"
                "   | \|| || \n"
                "   \ '|| || \n"
                "    \)()-()) \n"
                "ᅠ ᅠ ᅠᅠ ᅠ ᅠᅠ"
            ),
            (
                "ᅠ ᅠ    ᅠᅠ ᅠ ᅠᅠ\n"
                "    /\_____/\ \n"
                "   /  o   o  \ \n"
                "  ( ==  ^  == ) \n"
                "   )  skillз  ( \n"
                "  (           ) \n"
                " ( (  )   (  ) ) \n"
                "(__(__)___(__)__) \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ ᅠᅠ"
            ),
            (
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠᅠᅠᅠᅠ\n"
                "  /\ ___ /\ \n"
                " (  o   o  ) \n"
                "  \  >#<  / \n"
                "  /       \ \n"
                " /         \       ^ \n"
                "|           |     // \n"
                " \         /    //\n"
                "  ///  ///   --\n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠᅠᅠᅠᅠᅠ"
            ),
            (
                "ᅠ ᅠ ᅠᅠ ᅠᅠᅠᅠᅠ\n"
                "      ,_     _, \n"
                "      |\\___//| \n"
                "      |=6   6=| \n"
                "      \=._Y_.=/ \n"
                "       )  `  (    , \n"
                "      /       \  (( \n"
                "      |       |   )) \n"
                "     /| |   | |\_// \n"
                "     \| |._.| |/-` \n"
                "      '''   ''' \n"
                "ᅠ ᅠ ᅠᅠ ᅠᅠ ᅠ  ᅠᅠ"
            ),
        ]
        await utils.answer(message, f"<code>{r.choice(cats)}</code>")
